app/controllers/superheros_controller.rb

INSERT INTO "superheros" ("name", "superpower", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Batman"], ["superpower", "Intelligence"], ["created_at", "2023-03-28 09:28:40.996376"], ["updated_at", "2023-03-28 09:28:40.996376"]]
---
  def create
    @superhero = Superhero.new(superhero_params)

    if @superhero.save